In [1]:
import pandas as pd
import re

In [2]:
# --- Day 5: Binary Boarding ---
# You board your plane only to discover a new problem: you dropped your boarding pass! You aren't sure which seat is yours, and all of the flight attendants are busy with the flood of people that suddenly made it through passport control.

# You write a quick program to use your phone's camera to scan all of the nearby boarding passes (your puzzle input); perhaps you can find your seat through process of elimination.

# Instead of zones or groups, this airline uses binary space partitioning to seat people. A seat might be specified like FBFBBFFRLR, where F means "front", B means "back", L means "left", and R means "right".

# The first 7 characters will either be F or B; these specify exactly one of the 128 rows on the plane (numbered 0 through 127). Each letter tells you which half of a region the given seat is in. Start with the whole list of rows; the first letter indicates whether the seat is in the front (0 through 63) or the back (64 through 127). The next letter indicates which half of that region the seat is in, and so on until you're left with exactly one row.

# For example, consider just the first seven characters of FBFBBFFRLR:

# Start by considering the whole range, rows 0 through 127.
# F means to take the lower half, keeping rows 0 through 63.
# B means to take the upper half, keeping rows 32 through 63.
# F means to take the lower half, keeping rows 32 through 47.
# B means to take the upper half, keeping rows 40 through 47.
# B keeps rows 44 through 47.
# F keeps rows 44 through 45.
# The final F keeps the lower of the two, row 44.
# The last three characters will be either L or R; 
# these specify exactly one of the 8 columns of seats on the plane (numbered 0 through 7). 
# The same process as above proceeds again, this time with only three steps. L means to keep the lower half, while R means to keep the upper half.

# For example, consider just the last 3 characters of FBFBBFFRLR:

# Start by considering the whole range, columns 0 through 7.
# R means to take the upper half, keeping columns 4 through 7.
# L means to take the lower half, keeping columns 4 through 5.
# The final R keeps the upper of the two, column 5.
# So, decoding FBFBBFFRLR reveals that it is the seat at row 44, column 5.

# Every seat also has a unique seat ID: multiply the row by 8, then add the column. In this example, the seat has ID 44 * 8 + 5 = 357.

# Here are some other boarding passes:

# BFFFBBFRRR: row 70, column 7, seat ID 567.
# FFFBBBFRRR: row 14, column 7, seat ID 119.
# BBFFBBFRLL: row 102, column 4, seat ID 820.
# As a sanity check, look through your list of boarding passes. What is the highest seat ID on a boarding pass?

In [3]:
df = pd.read_excel('seat_numbers.xlsx')
df.head()

  seat_number_code
0       BBFFFFBRLL
1       BFBBBBFLLL
2       FBBBFBFLLR
3       BFBBBFBLRR
4       FBBFFBFLRR

In [4]:
df['row_number_code'] = df.seat_number_code.str[0:7]
df['column_number_code'] = df.seat_number_code.str[-3:]

In [5]:
df.head()

  seat_number_code row_number_code column_number_code
0       BBFFFFBRLL         BBFFFFB                RLL
1       BFBBBBFLLL         BFBBBBF                LLL
2       FBBBFBFLLR         FBBBFBF                LLR
3       BFBBBFBLRR         BFBBBFB                LRR
4       FBBFFBFLRR         FBBFFBF                LRR

In [6]:
# convert to (U)pper and (L)ower

def upper_lower(value):

    value = re.sub(r'B', 'U', value)
    value = re.sub(r'F', 'L', value)
    value = re.sub(r'R', 'U', value)

    return value

In [7]:
# F means to take the lower half, keeping rows 0 through 63.
# B means to take the upper half, keeping rows 32 through 63.

df['row_number_code'] = df.row_number_code.apply(upper_lower)

# R means to take the upper half, keeping columns 4 through 7.
# L means to take the lower half, keeping columns 4 through 5.
    
df['column_number_code'] = df.column_number_code.apply(upper_lower)

In [8]:
df.head()

  seat_number_code row_number_code column_number_code
0       BBFFFFBRLL         UULLLLU                ULL
1       BFBBBBFLLL         ULUUUUL                LLL
2       FBBBFBFLLR         LUUULUL                LLU
3       BFBBBFBLRR         ULUUULU                LUU
4       FBBFFBFLRR         LUULLUL                LUU

In [9]:
def get_number_row(code):
    
    rows = list(range(0,128))

    n = 64

    for letter in code:

        if letter == 'U': 

            for r in range(0,n):
                rows.remove(min(rows))

        if letter == 'L': 

            for r in range(0,n):
                rows.remove(max(rows))

        n //=2
        
    return rows[0]

In [10]:
def get_number_column(code):
    
    columns = list(range(0,8))

    n = 4

    for letter in code:

        if letter == 'U': 

            for r in range(0,n):
                columns.remove(min(columns))

        if letter == 'L': 

            for r in range(0,n):
                columns.remove(max(columns))

        n //=2 
        
    return columns[0]

In [11]:
df['row_number'] = df.row_number_code.apply(get_number_row)
df['column_number'] = df.column_number_code.apply(get_number_column)

In [12]:
df.head()

,seat_number_code,row_number_code,column_number_code,row_number,column_number
0,BBFFFFBRLL,UULLLLU,ULL,97,4
1,BFBBBBFLLL,ULUUUUL,LLL,94,0
2,FBBBFBFLLR,LUUULUL,LLU,58,1
3,BFBBBFBLRR,ULUUULU,LUU,93,3
4,FBBFFBFLRR,LUULLUL,LUU,50,3

In [13]:
df['seat_number'] = (df.row_number * 8) + df.column_number

In [14]:
df.head()

,seat_number_code,row_number_code,column_number_code,row_number,column_number,seat_number
0,BBFFFFBRLL,UULLLLU,ULL,97,4,780
1,BFBBBBFLLL,ULUUUUL,LLL,94,0,752
2,FBBBFBFLLR,LUUULUL,LLU,58,1,465
3,BFBBBFBLRR,ULUUULU,LUU,93,3,747
4,FBBFFBFLRR,LUULLUL,LUU,50,3,403

In [15]:
df.seat_number.max()

883

In [16]:
df.seat_number.min()

85

In [17]:
# --- Part Two ---
# Ding! The "fasten seat belt" signs have turned on. Time to find your seat.

# It's a completely full flight, so your seat should be the only missing boarding pass in your list. 
# However, there's a catch: some of the seats at the very front and back of the plane don't exist on this aircraft, so they'll be missing from your list as well.

# Your seat wasn't at the very front or back, though; the seats with IDs +1 and -1 from yours will be in your list.

# What is the ID of your seat?

In [18]:
seat_ids = list(df.seat_number)
seat_ids

[780,
 752,
 465,
 747,
 403,
 151,
 376,
 581,
 580,
 726,
 267,
 809,
 845,
 677,
 302,
 533,
 253,
 553,
 508,
 430,
 338,
 180,
 662,
 489,
 211,
 694,
 281,
 407,
 90,
 494,
 690,
 810,
 770,
 869,
 190,
 261,
 99,
 546,
 653,
 851,
 487,
 276,
 258,
 523,
 114,
 372,
 187,
 260,
 131,
 862,
 91,
 607,
 202,
 742,
 196,
 299,
 444,
 397,
 290,
 95,
 796,
 703,
 803,
 152,
 112,
 446,
 849,
 644,
 613,
 709,
 798,
 659,
 399,
 137,
 541,
 823,
 744,
 235,
 146,
 125,
 655,
 806,
 611,
 88,
 496,
 657,
 863,
 365,
 404,
 714,
 710,
 309,
 442,
 289,
 109,
 409,
 118,
 870,
 229,
 543,
 501,
 847,
 596,
 642,
 463,
 432,
 529,
 777,
 163,
 478,
 562,
 272,
 773,
 116,
 236,
 589,
 819,
 491,
 586,
 133,
 510,
 393,
 257,
 436,
 582,
 401,
 201,
 477,
 625,
 215,
 92,
 286,
 570,
 824,
 362,
 794,
 490,
 816,
 359,
 722,
 306,
 682,
 730,
 105,
 86,
 471,
 457,
 563,
 547,
 791,
 107,
 518,
 385,
 839,
 455,
 645,
 708,
 233,
 624,
 278,
 135,
 246,
 139,
 495,
 800,
 481,
 304,
 748,
 388,
 429,
 619,
 172,
 820,
 176,
 616,
 262,
 298,
 148,
 767,
 297,
 138,
 155,
 670,
 173,
 162,
 866,
 145,
 123,
 606,
 221,
 593,
 223,
 831,
 545,
 743,
 728,
 216,
 345,
 227,
 144,
 584,
 368,
 860,
 303,
 836,
 838,
 538,
 646,
 150,
 435,
 574,
 136,
 249,
 683,
 194,
 511,
 328,
 318,
 583,
 719,
 867,
 846,
 825,
 269,
 775,
 660,
 476,
 213,
 685,
 225,
 259,
 293,
 757,
 363,
 493,
 668,
 208,
 168,
 175,
 681,
 766,
 503,
 842,
 485,
 769,
 411,
 271,
 564,
 331,
 734,
 534,
 143,
 188,
 774,
 731,
 423,
 587,
 560,
 652,
 872,
 676,
 113,
 452,
 663,
 199,
 799,
 531,
 519,
 811,
 509,
 801,
 633,
 483,
 230,
 352,
 828,
 296,
 605,
 394,
 160,
 466,
 98,
 486,
 702,
 569,
 346,
 715,
 835,
 315,
 156,
 643,
 844,
 468,
 738,
 638,
 635,
 212,
 320,
 514,
 750,
 126,
 266,
 500,
 195,
 433,
 692,
 649,
 698,
 141,
 630,
 763,
 284,
 351,
 93,
 691,
 344,
 204,
 431,
 526,
 472,
 840,
 169,
 238,
 336,
 693,
 421,
 159,
 585,
 274,
 263,
 220,
 292,
 787,
 740,
 378,
 120,
 783,
 504,
 170,
 590,
 219,
 656,
 484,
 108,
 552,
 876,
 153,
 778,
 881,
 717,
 528,
 817,
 832,
 448,
 735,
 247,
 877,
 704,
 129,
 329,
 449,
 755,
 419,
 366,
 576,
 439,
 316,
 382,
 119,
 334,
 209,
 696,
 147,
 695,
 505,
 599,
 279,
 784,
 415,
 680,
 827,
 134,
 177,
 117,
 104,
 353,
 343,
 711,
 671,
 357,
 181,
 615,
 688,
 111,
 612,
 128,
 228,
 878,
 843,
 158,
 438,
 776,
 716,
 164,
 705,
 413,
 658,
 732,
 231,
 354,
 725,
 206,
 305,
 369,
 566,
 127,
 575,
 422,
 782,
 793,
 727,
 542,
 434,
 445,
 322,
 598,
 370,
 762,
 140,
 618,
 341,
 608,
 760,
 179,
 855,
 103,
 550,
 837,
 833,
 515,
 437,
 226,
 325,
 161,
 667,
 628,
 410,
 713,
 295,
 629,
 697,
 537,
 592,
 707,
 517,
 802,
 673,
 771,
 178,
 335,
 245,
 880,
 540,
 375,
 597,
 97,
 416,
 94,
 754,
 149,
 300,
 467,
 821,
 499,
 268,
 578,
 640,
 813,
 745,
 412,
 340,
 858,
 602,
 234,
 217,
 595,
 470,
 626,
 729,
 651,
 314,
 288,
 807,
 604,
 551,
 634,
 405,
 294,
 287,
 779,
 450,
 242,
 544,
 741,
 182,
 371,
 115,
 557,
 475,
 224,
 85,
 396,
 447,
 647,
 746,
 795,
 665,
 721,
 830,
 384,
 841,
 761,
 157,
 237,
 379,
 427,
 822,
 804,
 459,
 559,
 579,
 222,
 383,
 864,
 312,
 395,
 712,
 264,
 699,
 521,
 617,
 291,
 441,
 252,
 561,
 186,
 374,
 530,
 406,
 110,
 254,
 786,
 387,
 756,
 591,
 192,
 637,
 706,
 666,
 789,
 337,
 797,
 456,
 454,
 516,
 167,
 556,
 453,
 736,
 424,
 193,
 565,
 788,
 506,
 684,
 502,
 834,
 759,
 650,
 174,
 687,
 132,
 865,
 185,
 882,
 380,
 243,
 154,
 829,
 720,
 330,
 520,
 301,
 488,
 402,
 568,
 418,
 96,
 678,
 524,
 594,
 622,
 718,
 122,
 191,
 367,
 240,
 812,
 308,
 321,
 535,
 232,
 458,
 571,
 87,
 285,
 323,
 474,
 479,
 859,
 627,
 513,
 852,
 600,
 241,
 539,
 324,
 654,
 857,
 89,
 319,
 417,
 348,
 639,
 577,
 686,
 753,
 425,
 525,
 280,
 768,
 251,
 218,
 772,
 358,
 184,
 573,
 469,
 386,
 207,
 339,
 700,
 672,
 313,
 554,
 391,
 497,
 536,
 426,
 567,
 815,
 814,
 124,
 826,
 733,
 873,
 723,
 270,
 603,
 808,
 473,
 360,
 853,
 632,
 588,
 875,
 307,
 805,
 549,
 356,
 631,
 464,
 883,
 400,
 874,
 282,
 364,
 758,
 548,
 701,
 130,
 142,
 311,
 781,
 555,
 818,
 198,
 349,
 420,
 460,
 440,
 414,
 689,
 203,
 248,
 785,
 381,
 674,
 255,
 661,
 492,
 764,
 765,
 480,
 392,
 848,
 522,
 428,
 861,
 601,
 210,
 373,
 461,
 275,
 675,
 527,
 620,
 342,
 871,
 443,
 317,
 856,
 183,
 361,
 679,
 879,
 189,
 350,
 648,
 332,
 277,
 283,
 389,
 724,
 347,
 239,
 390,
 355,
 462,
 273,
 165,
 408,
 101,
 512,
 121,
 166,
 868,
 100,
 790,
 200,
 310,
 749,
 669,
 327,
 737,
 326,
 609,
 377,
 205,
 256,
 854,
 482,
 751,
 610,
 614,
 850,
 398,
 558,
 265,
 214,
 636,
 641,
 197,
 664,
 623,
 572,
 106,
 171,
 102,
 250,
 739,
 498,
 451,
 621,
 792,
 507,
 333,
 244]

In [19]:
df.column_number.value_counts()

7    100
6    100
5    100
3    100
2    100
1    100
0    100
4     98
Name: column_number, dtype: int64

In [20]:
df.row_number.value_counts()

60     8
36     8
38     8
39     8
40     8
      ..
83     8
12     8
66     7
110    4
10     3
Name: row_number, Length: 101, dtype: int64

In [21]:
df_4 = df[df.column_number == 4]
df_4

,seat_number_code,row_number_code,column_number_code,row_number,column_number,seat_number
0,BBFFFFBRLL,UULLLLU,ULL,97,4,780
8,BFFBFFFRLL,ULLULLL,ULL,72,4,580
18,FBBBBBBRLL,LUUUUUU,ULL,63,4,508
21,FFBFBBFRLL,LLULUUL,ULL,22,4,180
41,FBFFFBFRLL,LULLLUL,ULL,34,4,276
...,...,...,...,...,...,...
756,BBFBBFFRLL,UULUULL,ULL,108,4,868
757,FFFBBFFRLL,LLLUULL,ULL,12,4,100
780,BFFBBBBRLL,ULLUUUU,ULL,79,4,636
785,BFFFBBBRLL,ULLLUUU,ULL,71,4,572
797,FFBBBBFRLL,LLUUUUL,ULL,30,4,244

In [22]:
df.row_number.value_counts()

60     8
36     8
38     8
39     8
40     8
      ..
83     8
12     8
66     7
110    4
10     3
Name: row_number, Length: 101, dtype: int64

In [23]:
li = []
rows = [66,110,10]
column =4

for number in rows:
    
    li.append((number*8)+column)
li

[532, 884, 84]

In [27]:
li = [532, 884, 84]

seat_ids = list(df.seat_number)

for id_num in li:
    
    id_up = id_num + 1
    
    id_down = id_num - 1
        
    if (id_up in seat_ids) & (id_down in seat_ids):
        
        print(id_num)

532